src/tests/demo_api_load.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 20
      arrivalRate: 5
      name: Startup phase
  plugins:
    ensure: {}

  ensure:
    thresholds:
      - http.response_time.max: 1000
    conditions:
      - expression: "http.codes.200 == http.requests"
scenarios:
  - flow:
      - get:
          url: "/api/v1/seized-goods"